Revit 2026 API

# GlazingGlazingTransmittanceMap Property

---

The property labeled "Custom Color" from the "Glazing" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GlazingTransmittanceMap { get; }
```
```vb
Public Shared ReadOnly Property GlazingTransmittanceMap As String
	Get
```
```cpp
public:
static property String^ GlazingTransmittanceMap {
	String^ get ();
}
```
```fsharp
static member GlazingTransmittanceMap : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Glazing Class

Autodesk.Revit.DB.Visual Namespace